In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Import Data
path = r'/Users/azadeh/Documents/Instacart Basket Analysis'

In [3]:
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [4]:
# Import orders_products_merged_flags
df_ords_prods_merge =  pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data','orders_products_merged_flags.pkl'))

# Data Wrangling

In [5]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
df_customers.shape

(206209, 10)

In [8]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [9]:
df_customers.shape

(206209, 10)

1.Renaming Columns names
2.check for missing value (addressing missing values by "unknown" imputation)
3.changing user_id data type
4.finding duplicate
5.Check for mixed-type data in df_ords dataframe
6.Merge df_ords_prods_merge and df_customers using user_id as a keys

In [10]:
#Renaming Columns names
df_customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)
df_customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)
df_customers.rename(columns = {'STATE' : 'state'}, inplace = True)
df_customers.rename(columns = {'n_dependants' : 'dependent_count'}, inplace = True)
df_customers.rename(columns = {'Age' : 'age'}, inplace = True)
df_customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [11]:
df_customers.head()

,user_id,first_name,surname,gender,state,age,date_joined,dependent_count,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
# check for missing value
df_customers.isnull().sum()

user_id                0
first_name         11259
surname                0
gender                 0
state                  0
age                    0
date_joined            0
dependent_count        0
fam_status             0
income                 0
dtype: int64

In [13]:
#addressing missing values by "unknown" imputation
df_customers['first_name'].fillna('Unknown', inplace=True)

In [14]:
df_customers.isnull().sum()

user_id            0
first_name         0
surname            0
gender             0
state              0
age                0
date_joined        0
dependent_count    0
fam_status         0
income             0
dtype: int64

In [15]:
# changing user_id data type
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [16]:
# changing user_id data type
df_ords_prods_merge['user_id'] = df_ords_prods_merge['user_id'].astype('str')

In [17]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   user_id          206209 non-null  object
 1   first_name       206209 non-null  object
 2   surname          206209 non-null  object
 3   gender           206209 non-null  object
 4   state            206209 non-null  object
 5   age              206209 non-null  int64
 6   date_joined      206209 non-null  object
 7   dependent_count  206209 non-null  int64
 8   fam_status       206209 non-null  object
 9   income           206209 non-null  int64
dtypes: int64(3), object(7)
memory usage: 15.7+ MB

In [18]:
# finding duplicate
df_dups_customers = df_customers[df_customers.duplicated()]

In [19]:
df_dups_customers.shape

(0, 10)

There is No Duplicate

In [20]:
# Check for mixed-type data in df_ords dataframe.

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col, ' mixed')
  else: print (col, ' consistent')

user_id  consistent
first_name  consistent
surname  consistent
gender  consistent
state  consistent
age  consistent
date_joined  consistent
dependent_count  consistent
fam_status  consistent
income  consistent

In [21]:
df_ords_prods_merge.shape

(32404859, 26)

In [22]:
df_customers.shape

(206209, 10)

In [23]:
# Merge df_ords_prods_merge and df_customers using user_id as a keys
df_ords_prods_customer_merge = df_ords_prods_merge.merge(df_customers, on = ['user_id'])

In [24]:
df_ords_prods_customer_merge.shape

(32404859, 35)

In [25]:
df_ords_prods_customer_merge.head()

,Unnamed: 0_x,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days since the last order,product_id,add_to_cart_order,reordered,...,order_frequency_flag,first_name,surname,gender,state,age,date_joined,dependent_count,fam_status,income
0,0,2539329,1,1,2,8,NaN,196,1,0,...,Non-frequent,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,1,2398795,1,2,3,7,15.0,196,1,1,...,Non-frequent,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2,473747,1,3,3,12,21.0,196,1,1,...,Non-frequent,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,3,2254736,1,4,4,7,29.0,196,1,1,...,Non-frequent,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,4,431534,1,5,4,15,28.0,196,1,1,...,Non-frequent,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [26]:
#exporting 
df_ords_prods_customer_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merge.pkl'))